In [108]:
import numpy as np
import pandas as pd
df2 = pd.DataFrame({ 'first' : pd.Series(["jamie","john","jolly","jamie"]),
                  'Last' :pd.Series(["rahman","fernendez","smash","kapoor"]),
                  'C' : pd.Series([5,3,1,7]),
                  'D' : np.array([3] * 4,dtype='int32'),
                  'E' : pd.Categorical(["test","train","test","train"]),
                  'F' : 'foo' })

In [109]:
df2.dtypes

first      object
Last       object
C           int64
D           int32
E        category
F          object
dtype: object

In [110]:
df2

   first       Last  C  D      E    F
0  jamie     rahman  5  3   test  foo
1   john  fernendez  3  3  train  foo
2  jolly      smash  1  3   test  foo
3  jamie     kapoor  7  3  train  foo

In [118]:
var=df2.groupby("first")
var.first()

In [120]:
var1=var.get_group("jamie")
var1["Last"]

0    rahman
3    kapoor
Name: Last, dtype: object

In [121]:
df2

   first       Last  C  D      E    F
0  jamie     rahman  5  3   test  foo
1   john  fernendez  3  3  train  foo
2  jolly      smash  1  3   test  foo
3  jamie     kapoor  7  3  train  foo

In [122]:
df2.columns

Index(['first', 'Last', 'C', 'D', 'E', 'F'], dtype='object')

In [126]:
df2.sort_values('C')

   first       Last  C  D      E    F
2  jolly      smash  1  3   test  foo
1   john  fernendez  3  3  train  foo
0  jamie     rahman  5  3   test  foo
3  jamie     kapoor  7  3  train  foo

In [129]:
df2

   first       Last  C  D      E    F
0  jamie     rahman  5  3   test  foo
1   john  fernendez  3  3  train  foo
2  jolly      smash  1  3   test  foo
3  jamie     kapoor  7  3  train  foo

In [128]:
df2[0:3]

   first       Last  C  D      E    F
0  jamie     rahman  5  3   test  foo
1   john  fernendez  3  3  train  foo
2  jolly      smash  1  3   test  foo

In [130]:
df2.iloc[0:2]

   first       Last  C  D      E    F
0  jamie     rahman  5  3   test  foo
1   john  fernendez  3  3  train  foo

In [134]:
#x=df2.iloc[:,0:5]
y=df2['F']
x=df2.drop(['F'],axis=1)
x

   first       Last  C  D      E
0  jamie     rahman  5  3   test
1   john  fernendez  3  3  train
2  jolly      smash  1  3   test
3  jamie     kapoor  7  3  train

In [131]:
y

0    foo
1    foo
2    foo
3    foo
Name: F, dtype: object

In [137]:
df2[df2.C <5]

   first       Last  C  D      E    F
1   john  fernendez  3  3  train  foo
2  jolly      smash  1  3   test  foo

In [138]:
df2['G']=['four', 'five','two','three']

In [139]:
df2

   first       Last  C  D      E    F      G
0  jamie     rahman  5  3   test  foo   four
1   john  fernendez  3  3  train  foo   five
2  jolly      smash  1  3   test  foo    two
3  jamie     kapoor  7  3  train  foo  three

In [140]:
df2.isnull().sum()
#NAN value

first    0
Last     0
C        0
D        0
E        0
F        0
G        0
dtype: int64

In [141]:
df2.dropna(how='any')

   first       Last  C  D      E    F      G
0  jamie     rahman  5  3   test  foo   four
1   john  fernendez  3  3  train  foo   five
2  jolly      smash  1  3   test  foo    two
3  jamie     kapoor  7  3  train  foo  three

In [142]:
df2["D"].mean()

3.0

In [143]:
df2.mean()

C    4.0
D    3.0
dtype: float64

In [145]:
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3],
        'coverage': [25, 94, 57, 62, 70]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

             name  year  reports  coverage
Cochice     Jason  2012        4        25
Pima        Molly  2012       24        94
Santa Cruz   Tina  2013       31        57
Maricopa     Jake  2014        2        62
Yuma          Amy  2014        3        70

In [146]:
df1 = df.drop('name',axis=1)
df1

            year  reports  coverage
Cochice     2012        4        25
Pima        2012       24        94
Santa Cruz  2013       31        57
Maricopa    2014        2        62
Yuma        2014        3        70

In [147]:
df1['coverage']=df1['coverage'].apply(np.sqrt)
df1

            year  reports  coverage
Cochice     2012        4  5.000000
Pima        2012       24  9.695360
Santa Cruz  2013       31  7.549834
Maricopa    2014        2  7.874008
Yuma        2014        3  8.366600

In [148]:
from scipy import stats
def mean_calculate(var1):
   
    if var1==4:
        return 'A'
    if var1==24:
        return 'B'
    else:
        return 'N'

df1["reports"]=df1['reports'].apply(mean_calculate)

In [149]:
df1["reports"]

Cochice       A
Pima          B
Santa Cruz    N
Maricopa      N
Yuma          N
Name: reports, dtype: object

In [150]:
s1 = pd.Series(np.random.randn(3), index=['a', 'b', 'c'])
s2 = pd.Series(np.random.randn(4), index=['b', 'c', 'd', 'f'])
s=s1+s2
s

a         NaN
b    0.175121
c    0.730295
d         NaN
f         NaN
dtype: float64

In [151]:
p=s.dropna()
p

b    0.175121
c    0.730295
dtype: float64

In [152]:
p=s.fillna(5)
p

a    5.000000
b    0.175121
c    0.730295
d    5.000000
f    5.000000
dtype: float64

In [153]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'],columns=['one', 'two', 'three'])

In [154]:
df

        one       two     three
a -0.669178 -0.113750 -0.659747
c  0.431727 -0.976720 -1.394126
e -0.776628 -0.560401  2.912152
f -0.582332 -1.655226 -1.290193
h  1.025462  1.480625 -1.360081

In [158]:
df['four'] = 'bar'
df

        one       two     three four   five
a -0.669178 -0.113750 -0.659747  bar  False
c  0.431727 -0.976720 -1.394126  bar   True
e -0.776628 -0.560401  2.912152  bar  False
f -0.582332 -1.655226 -1.290193  bar  False
h  1.025462  1.480625 -1.360081  bar   True

In [159]:
df['five'] = df['one'] > 0

In [160]:
df

        one       two     three four   five
a -0.669178 -0.113750 -0.659747  bar  False
c  0.431727 -0.976720 -1.394126  bar   True
e -0.776628 -0.560401  2.912152  bar  False
f -0.582332 -1.655226 -1.290193  bar  False
h  1.025462  1.480625 -1.360081  bar   True

In [161]:
df2 = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

In [162]:
df2

        one       two     three four   five
a -0.669178 -0.113750 -0.659747  bar  False
b       NaN       NaN       NaN  NaN    NaN
c  0.431727 -0.976720 -1.394126  bar   True
d       NaN       NaN       NaN  NaN    NaN
e -0.776628 -0.560401  2.912152  bar  False
f -0.582332 -1.655226 -1.290193  bar  False
g       NaN       NaN       NaN  NaN    NaN
h  1.025462  1.480625 -1.360081  bar   True

In [163]:
df2.isnull().sum()

one      3
two      3
three    3
four     3
five     3
dtype: int64

In [165]:
f2 = df2.drop(["five"],axis=1)
f2

        one       two     three four
a -0.669178 -0.113750 -0.659747  bar
b       NaN       NaN       NaN  NaN
c  0.431727 -0.976720 -1.394126  bar
d       NaN       NaN       NaN  NaN
e -0.776628 -0.560401  2.912152  bar
f -0.582332 -1.655226 -1.290193  bar
g       NaN       NaN       NaN  NaN
h  1.025462  1.480625 -1.360081  bar

In [166]:
df2.dropna()

        one       two     three four   five
a -0.669178 -0.113750 -0.659747  bar  False
c  0.431727 -0.976720 -1.394126  bar   True
e -0.776628 -0.560401  2.912152  bar  False
f -0.582332 -1.655226 -1.290193  bar  False
h  1.025462  1.480625 -1.360081  bar   True

In [168]:
import pandas as pd
df = pd.DataFrame([[1,1.23,'Hello']], columns=list('ABC'))

In [169]:
df

   A     B      C
0  1  1.23  Hello